<template>
  <view class="content">
    <view class="title">导言</view>
    <view class="p1"
      >深圳市豪斯莱科技有限公司（以下简称“豪斯莱”或“公司”）深知个人信息保护对您的重要性，并会尽我们最大努力保护您的个人信息安全，我们将依法采取安全保护措施，保护您的个人信息及隐私安全，并将恪守以下原则：权责一致原则、目的明确原则、选择同意原则、最少够用原则、确保安全原则、主体参与原则、公开透明原则等。</view
    >
    <view class="p1">
      在您使用豪斯莱相关服务时，我们将按本《隐私政策》收集、保存、使用、共享、披露及保护您的个人信息。我们希望通过本《隐私政策》向您介绍我们对您个人信息的处理方式。因此，我们提请您：在使用豪斯莱相关服务、提交个人信息前，仔细阅读并透彻理解本《隐私政策》，在确认充分理解并同意后方使用相关产品和服务。如一旦您开始使用豪斯莱相关服务，则视为接受和认可本政策的全部内容。在我们更新本《隐私政策》后（我们会及时发布最新版本），如您继续使用豪斯莱相关服务，即意味着您完全理解本《隐私政策》（含更新版本）的全部内容，并同意我们按照本《隐私政策》收集、保存、使用、共享、披露及保护您的相关个人信息。</view
    >
    <view class="title">定义</view>
    <view class="p1"
      >1.1、豪斯莱相关服务是指，豪斯莱及其关联方通过电子邮件、公众号、小程序、短信、电话等其他可行的方式一次或多次向您提供电子卡券资讯信息的推广及电子卡券产品的宣传、出售服务，电子卡券包括但不限于【优惠券、代金券、礼品卡等电子卡券】，具体以豪斯莱提供的二维图、条形码、兑换码、密码等组合形式体现。<br/>
      1.2、关联方是指，因合作、投资或控制（或共同控制）关系而与豪斯莱产生任何联系的公司、组织或个人。<br/>
      1.3、第三方是指，本《隐私政策》约定的关联方范围以外的其他公司、组织或个人。</view
    >
  </view>
</template>
<style lang="scss" scoped>
.content {
  padding: 22rpx 40rpx 40rpx;
  border-top: #f3f4f3 4px solid;
  background: #ffffff;
}
.title {
  margin: 16rpx 0;
  font-size: 36rpx;
  color: #000000;
  letter-spacing: 0.45px;
}
.p1 {
  margin: 44rpx 0 16rpx;
  opacity: 0.6;
  font-size: 26rpx;
  color: #000000;
  letter-spacing: 0.43px;
  text-align: justify;
  line-height: 48rpx;
}
</style>
