<template>
	<view class="content">
		<view class="title">特别提示</view>
		<view class="p1">请您认真阅读本协议项下的全部条款。签订并确认本协议，即认为您已理解并同意本协议的所有内容。</view>
		<view class="title">第一条 定义</view>
		<view class="p1">
			甲方：即指签署本协议的参与方，即您。
			<br />
			乙方：深圳市豪斯莱科技有限公司（以下简称“豪斯莱”）
			<br />
			豪斯莱关联方：因合作、投资或控制（或共同控制）关系而与豪斯莱产生任何联系的公司、组织或个人
			<br />
			第三方：本《用户服务协议》约定的关联方范围以外的其他公司、组织或个人
			<br />
			小程序 ：指乙方运营的名称为“摩卡星”的微信小程序。
			<br />
			电子卡券：指乙方在小程序上销售的产品，包括但不限于【优惠券、代金券、礼品卡等电子卡券】，具体以乙方提供的二维图、条形码、兑换码、密码等组合形式体现。
			<br />
			有效期：因电子卡券的特殊性，所有卡券限购买当日或24小时内使用，具体以系统显示为准。
			<br />
		</view>
		<view class="title">第二条 产品买卖</view>
		<view class="p1">
			2.1、乙方在“摩卡星”小程序上出售电子卡券
			<br />
			2.2、甲方在“摩卡星”小程序上购买电子卡券。电子卡券的价格、使用方式和有效期以系统的显示信息为准
			<br />
			2.3、乙方作为运营方出售电子卡券，乙方负有审核商品的义务，承诺、确保所有电子卡券真实、有效
			<br />
			2.4、甲方同意，如电子卡券出现质量问题或甲方针对电子卡券的质量提出异议，可在电子卡券的有效期内在小程序上申请售后。乙方作为运营方，须介入调查与处理！
			<br />
		</view>
		<view class="title">第三条 甲方的权利和义务</view>
		<view class="p1">
			3.1、甲方需按约定向乙方支付电子卡券的购买价款（即甲方在“摩卡星”小程序上看到的商品价格）
			<br />
			3.2、甲方对电子卡券的质量有异议时，有权在电子卡券有效期内寻找客服提出售后申请。如已过电子卡券有效期，甲方认同交易完成且无法再申请售后的事实
			<br />
			3.3、甲方自愿在小程序上填写个人信息，并在提交成功之后有权享有乙方提供的服务。
			<br />
			3.4、甲方在提交申请时需要填写合法有效的个人信息；甲方须保证所填写的个人信息和所提供的资料真实、准确、完整，对于因甲方提供的信息不真实、不准确或不完整导致的损失由甲方承担。
			<br />
			3.5、甲方自愿提供个人信息并使用“摩卡星”小程序提供的服务，确认以“摩卡星”小程序要求的技术操作方式填写信息并自愿承担责任。
			<br />
		</view>
		<view class="title">第四条 乙方的权利和义务</view>
		<view class="p1">
			4.1、乙方有向甲方销售电子卡券的权利
			<br />
			4.2、乙方作为运营方出售电子卡券，乙方负有审核商品的义务，承诺、确保所有电子卡券真实、有效
			<br />
			4.3、若甲方因使用从“摩卡星”小程序购买的电子卡券发生纠纷或争议，乙方有义务配合甲方进行调查并处理纠纷或争议，且甲方认同乙方对纠纷处理的结果
			<br />
			4.4、因以下情况没有正确执行甲方提交的指令，乙方不承担任何责任：
			<br />
			（1）甲方未能按照运营方的规则在小程序进行操作
			<br />
			（2）不可抗力或意外事件
			<br />
			（3）运营商等非乙方可控制原因导致的网络堵塞、中断
			<br />
			（4）其他乙方无过失的情况。
			<br />
			4.5、乙方对甲方的个人信息负有保密义务，并保证乙方及必要豪斯莱关联方与乙方具有同等保密责任。但以下情况除外：
			<br />
			（1）应国家相关法律法规的规定或政府部门的要求必须披露；
			<br />
			（2）经甲方同意披露。
			<br />
		</view>
		<view class="title">第五条 甲方的陈述与保证</view>
		<view class="p1">
			甲方在此作出以下陈述与保证：
			<br />
			1、其有权签署和递交本协议并履行其在本协议项下的义务。
			<br />
			2、其在本协议项下的义务构成其合法、有效及有约束力的义务。
			<br />
			3、其已经取得所有为签署、递送和履行本协议所必要的批准、同意和授权，并且其签署、递交或履行本协议将不会与任何其为一方的或对其或其财产具有约束力的任何协议、协议或其他文件相冲突或违反其中任何条款或导致其违约；同时其签署、递送及履行本协议将不会与任何适用法律法规或任何适用的司法、行政或仲裁的命令、判决、禁令或决定相冲突。
		</view>
		<view class="title">第六条 违约</view>
		<view class="p1">
			1、发生下列情形之一的，构成甲方对乙方的违约：
			<br />
			（1）甲方未履行本协议下的任何义务（包括但不限于支付电子卡券的购买价款的义务）；
			<br />
			（2）其它乙方合理认为有可能导致甲方不能按照约定履行本协议项下义务的情形。
			<br />
			2、甲方发生上述违约情形的，乙方（及乙方指定的第三方）有权采取下列一项或多项救济措施：
			<br />
			（1）要求甲方限期纠正违约行为；
			<br />
			（2）要求甲方赔偿因其违约给乙方造成的直接和间接损失。
			<br />
			上述约定并不影响乙方根据本协议的其他条款及法律法规的规定行使相应的救济措施的权利。
		</view>
		<view class="title">第七条 隐私条款</view>
		<view class="p1">
			7.1、甲方同意其个人信息用于以下一项或多项用途：
			<br />
			（1）授权豪斯莱对收集的甲方个人信息进行数据存储、分析和处理
			<br />
			（2）应豪斯莱后期业务需要及为了向甲方提供更好地服务，甲方授权豪斯莱将甲方的个人信息提供给豪斯莱关联方对甲方个人信息进行数据存储、分析和处理
			<br />
			（3）由豪斯莱关联方向甲方提供电子卡券产品及服务的销售、合同订立、履行及售后服务等服务
			<br />
			（4）应甲方的咨询由乙方与甲方联络（包括：短信、电话、邮件以及互联网等方式）
			<br />
			7.2、为保持数据的准确性，防止非法入侵及确保甲方个人信息的合法、合规使用，乙方采取了适当的硬件、电子及管理措施以保障甲方个人信息的保密性
			<br />
			7.3、豪斯莱收集甲方个人信息的内容包括：
			<br />
			（1）个人身份信息：包括但不限于姓名、性别、年龄、出生日期、证件类型、证件号码、手机号码、联系地址、电子邮件等；
			<br />
			（2）个人背景信息：包括但不限于职业、健康情况、兴趣爱好、家庭情况、收入情况等；
			<br />
			（3））个人网络信息：使用Cookies、IP地址和其它技术方式收集甲方非个人化信息，以使乙方在甲方访问网站时可辨认其身份；
			<br />
			（4）其他乙方为提供服务所需要的个人信息。
			<br />
			7.4、 如甲方系未成年人应事先得到其监护人的同意，监护人应承担未成年人在本小程序享受服务过程中隐私权保护的首要责任。
			<br />
			7.5、若经未成年人监护人同意，乙方可对未成年人个人信息进行收集，但乙方将会向监护人披露此未成年人个人信息，监护人的同意包括但不限于口头的、书面的或者其他形式。
			<br />
			7.6、甲方及其监护人应对己方所提供信息的真实性负责，如乙方无法从甲方所提供信息判断出甲方为未成年人，那么乙方则不承担保护未成年隐私权的责任。
			<br />
			7.7、某些服务需由豪斯莱的合作伙伴（包括但不限于提供相关技术服务商、信息服务商、邮寄公司、提供奖品公司等）提供或共同提供，为了向甲方提供此类服务，豪斯莱的合作伙伴有必要将从豪斯莱获取的甲方个人信息与提供该服务的合作伙伴共享。
			<br />
			7.8、乙方及其合作伙伴承诺除为提供本协议约定之服务以外，不会将甲方的个人信息用于其他商业目的，也不会将甲方的个人信息泄露给任何无关第三方。
			<text>乙方承诺采取严格的隐私政策，尊重并保护甲方隐私，请甲方仔细阅读本条款并了解；本条款自本协议签署时生效，具有独立法律效力，不因协议未生效或无效而受影响。</text>
		</view>
		<view class="title">第八条 协议的效力</view>
		<view class="p1">
			1 、如本协议中的任何条款无论因何种原因完全或部分无效或不具有执行力，本协议的其余条款仍应有效并且有约束力，除非该其余条款或者本协议整体被法院的最终裁判认定无效。
			<br />
			2
			、本协议经甲方和乙方通过“摩卡星”小程序以在线点击确认的方式订立，订立后立即生效；甲方委托乙方作为小程序运营方保管所有与本协议有关的书面文件或电子信息；本协议各方确认并同意乙方提供的与本协议有关的书面文件或电子信息在无明显错误的情况下应作为本协议有关事项的终局证明。
		</view>
		<view class="title">第九条 法律适用与争议解决</view>
		<view class="p1">
			9.1、本协议的成立、生效、履行和解释，均适用中国人民共和国法律；法律无明文规定的，可适用通行的行业惯例。如本协议相关条款与中华人民共和国法律相抵触时，则这些条款将完全按法律规定重新解释，而其它条款则依旧保持对甲乙双方产生法律效力和影响。
			<br />
			9.2、甲乙双方在履行本协议的过程中，如发生争议，应协商解决。协商不成的，双方均可向豪斯莱所在地有管辖权的人民法院起诉。
		</view>
		<view class="title">第十条 免责条款</view>
		<view class="p1">
			10.1、乙方在以下情况下不承担责任，包括但不限于：
			<br />
			（1）如甲方在网吧等公众场所的公用电脑或其他网络设备、他人电脑或其他网络设备登录本小程序，须谨慎操作，由此造成的信息泄露损失乙方不承担责任。
			<br />
			（2）如果甲方在共享环境下或在电脑被远程监控的情况下登录本小程序，由此造成的信息泄露损失乙方不承担责任。
			<br />
			（3）如因无法预见、无法避免且无法克服的不可抗力事件，导致乙方及其关联方、授权方在本协议项下的义务无法履行或无法按时履行，则不应视为违约，也无需为此承担任何违约责任。
			<br />
			（4）如果甲方蓄意欺诈、不按照适用于甲方的本协议条款和条件履行合理谨慎义务或不遵守安全操作要求，由此造成的损失乙方及其关联方、授权方不承担责任。
			<br />
			（5）对于受到网络堵塞、中断、计算机病毒、木马或其他恶意程序、黑客攻击所造成的损失。
		</view>
		<view class="title">第十一条 本协议的更新</view>
		<view class="p1">
			<br />
			8.1在本协议履行过程中，因国家法律法规变化及本小程序运营需要，豪斯莱可根据情况对本服务协议进行修改。一旦本协议的内容发生变动，豪斯莱将通过小程序公布最新的服务协议，不再向甲方作个别通知。如果甲方不同意乙方对本协议所做的修改，甲方有权停止使用乙方服务。如果甲方继续使用服务，则视为甲方接受豪斯莱对本协议所做的修改，并应遵照修改后的协议执行。
		</view>
	</view>
</template>
<script>
export default {
	onLoad() {
		uni.setNavigationBarColor({
			backgroundColor: '#FFFFFF',
			frontColor: '#000000'
		});
	}
};
</script>
<style lang="scss" scoped>
.content {
	border-top: #f3f4f3 4px solid;
	background: #ffffff;
	padding: 0 40rpx 40rpx;
}
.title {
	margin: 40rpx 0 16rpx;
	font-size: 36rpx;
	color: #000000;
	letter-spacing: 0.45px;
}
.p1 {
	margin-bottom: 20rpx;
	opacity: 0.6;
	font-size: 26rpx;
	color: #000000;
	letter-spacing: 0.43px;
	text-align: justify;
	line-height: 48rpx;
	text {
		opacity: 1;
		font-weight: bold;
		color: #000000;
	}
}
</style>
